## 작업 1유형 연습문제

### 월드컵 출전선수 골기록 데이터

In [2]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv')
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

In [10]:
# Q21. 주어진 전체 기간의 각 나라별 골득점수 상위 5개 국가와 그 득점수를 데이터프레임 형태로 출력하라 
print(type(df[['Country', 'Goals']].groupby('Country').sum()))
df[['Country', 'Goals']].groupby('Country').sum().sort_values('Goals', ascending=False).head(5)

<class 'pandas.core.frame.DataFrame'>

           Goals
Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115

In [14]:
# Q22. 주어진 전체 기간 도안 골득점을 한 선수가 가장 많은 나라 상위 5개 국가와 그 선수 숫자를 데이터 프레임 형식으로 출력하라 
print(type(df[['Country', 'Player']].groupby('Country').size()))
df[['Country', 'Player']].groupby('Country').size().sort_values(ascending=False).head(5) # .to_frame()

<class 'pandas.core.series.Series'>

            0
Country
Brazil     81
Germany    78
Italy      60
Argentina  59
France     58

In [19]:
# Q23. Years 컬럼은 년도 - 년도 형식으로 구성되어있고, 각 년도는 4자리 숫자이다. 
# 년도 표기가 4자리 숫자로 안된 케이스가 존재한다. 
# 해당 건은 몇 건인지 출력하라 
def check(x):
    splited_x = x.split('-')
    cnt = 0
    for i in splited_x: 
        if len(i) != 4: 
            cnt +=1
    return cnt

df['Years'].apply(check).sum()

45

In [22]:
# Q24. Q3에서 발생한 예외 케이스를 제외한 데이터프레임을 df2라고 정의하고
# 데이터의 행의 숫자를 출력하라 
def check(x):
    splited_x = x.split('-')
    cnt = 0
    for i in splited_x: 
        if len(i) != 4: 
            return False
        else: 
            return True

df2 = df[df['Years'].apply(check)]
df2.reset_index(drop=True, inplace=True)
print(len(df2))

1250

In [33]:
# Q25. 월드컵 출전횟수를 나타내는 'LenCup'컬럼을 추가하고 
# 4회 출전한 선수의 숫자를 구하여라 
def check(x):
    splited_x = x.split('-')
    return len(splited_x)

(df2['Years'].apply(check)==4).sum()

16

In [34]:
# Q26. Yugoslavia 국가의 월드컵 출전횟수가 2회인 선수들의 숫자를 구하여라 
df3 = df2[df2['Country']=='Yugoslavia']
(df3['Years'].apply(check)==2).sum()

7

In [36]:
# Q27. 2002년도에 출전한 전체 선수는 몇명인가? 
def check(x):
    splited_x = x.split('-')
    for i in splited_x: 
        if i == '2002': 
            return True
    return False

df2['Years'].apply(check).sum()

156

In [37]:
# Q28. 이름에 'carlos' 단어가 들어가는 선수의 숫자는 몇 명인가? (대, 소문자 구분 x)
def check(x): 
    x = x.lower()
    if 'carlos' in x: 
        return True
    else: 
        return False
    
df2['Player'].apply(check).sum()

13

In [40]:
# Q29. 월드컵 출전 횟수가 1회뿐인 선수들 중에서 가장 많은 득점을 올렸던 선수는 누구인가? 
def check(x):
    splited_x = x.split('-')
    return len(splited_x)

df2[df2['Years'].apply(check)==1].sort_values('Goals', ascending=False).reset_index(drop=True).loc[0]['Player']

'Just Fontaine'

In [46]:
# Q30. 월드컵 출전횟수가 1회 뿐인 선수들이 가장 많은 국가는 어디인가? 
def check(x):
    splited_x = x.split('-')
    return len(splited_x)

df2[df2['Years'].apply(check)==1].groupby('Country').size().sort_values(ascending=False).index[0]

'Brazil'

### 서울시 따릉이 이용정보 데이터

In [47]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

In [58]:
# Q31. 대여일자별 데이터의 수를 데이터프레임으로 출력하고, 가장 많은 데이터가 있는 날짜를 출력하라 
# df.groupby('대여일자').size().to_frame()
ans = df['대여일자'].value_counts().sort_index().to_frame()
display(ans)
print(df['대여일자'].value_counts().sort_values(ascending=False).index[0])

             대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

2021-06-04

In [67]:
# Q32. 각 일자의 요일을 표기하고 ('Monday'~'Sunday') 'day_name' 컬럼을 추가하고 
# 이를 이용하여 각 요일별 이용 횟수의 총합을 데이터프레임으로 출력하라 
# df.info()
df['대여일자'] = pd.to_datetime(df['대여일자'])

df['day_name'] = df['대여일자'].dt.day_name()

# df.groupby('day_name').size().to_frame()
df['day_name'].value_counts().to_frame()

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

In [78]:
# Q33. 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라 
ans = df.groupby(['day_name', '대여소번호']).size().to_frame('size').sort_values(['day_name', 'size'], ascending=False).reset_index()
ans
ans.drop_duplicates('day_name', keep='first').reset_index(drop=True)

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

In [97]:
# Q34. 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 가장 높은 비율을 가지는 나이대를 확인하라 
# 일일권의 경우 일일권과 일일권(비회원)을 모두 포함하라 
size = df[df['대여구분코드'].isin(['일일권', '일일권(비회원)'])].groupby(['연령대코드']).size().to_frame('size').reset_index()
total = df.groupby(['연령대코드']).size().to_frame('total').reset_index()

ans = pd.DataFrame()
ans['연령대코드'] = size['연령대코드']
ans['ratio'] = size['size'] / total['total']
display(ans)

print('max ratio age ', ans.sort_values(by='ratio', ascending=False).iloc[0][0])

  연령대코드     ratio
0   20대  0.239913
1   30대  0.166702
2   40대  0.110585
3   50대  0.065414
4   60대  0.042462
5  70대~  0.048962
6  ~10대  0.312525

max ratio age  ~10대

In [101]:
# Q35. 연령대별 평균 이동거리를 구하여라 
df[['연령대코드', '이동거리']].groupby(['연령대코드']).mean()

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

In [135]:
# Q36. 연령대 코드가 20대인 데이터를 추출하고 
# 이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다. 
# 최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬한 후 
# 1행부터 200행까지 탄소량의 평균을 소숫점 3째 자리까지 구하여라 
df2 = df[df['연령대코드'] == '20대']
ans = df2[df2['이동거리']>=df2['이동거리'].mean()]\
    .sort_values(['대여일자', '대여소번호'], ascending=False).reset_index(drop=True)\
    .iloc[:200]['탄소량'].to_frame()
ans['탄소량'] = pd.to_numeric(ans['탄소량'])

display(ans)
print(round(ans['탄소량'].mean(), 3))

      탄소량
0    2.07
1    2.03
2    0.79
3    0.81
4    1.01
..    ...
195  0.86
196  1.54
197  3.44
198  1.13
199  1.44

[200 rows x 1 columns]

1.613

In [144]:
# Q37. 6월 7일 ~10대의 '이용건수'의 중앙값은? 
df2 = df[(df['대여일자']>=pd.to_datetime('2021-06-07'))&(df['연령대코드'] == '~10대')]
df2['이용건수'] = pd.to_numeric(df2['이용건수'])
df2['이용건수'].median()

C:\Temp\ipykernel_127220\58722775.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['이용건수'] = pd.to_numeric(df2['이용건수'])

1.0

In [157]:
# Q38. 평일 (월~금) 출근 시간대(오전 6, 7, 8시)의 대여소별 이용 횟수를 구해서 데이터프레임 형태로 표현한 후 
# 각 대여시간별 이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라 
df[df['대여시간'].isin([6, 7, 8])].groupby(['대여시간', '대여소번호']).size().to_frame('이용 횟수').sort_values(by='이용 횟수', ascending=False)

            이용 횟수
대여시간 대여소번호
8    2701     131
     646      121
7    259      108
8    1152     102
     1906      96
...           ...
7    647        1
     608        1
     606        1
     543        1
8    9980       1

[6463 rows x 1 columns]

In [ ]:
# Q39. 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [ ]:
# Q40. 남성('M' or 'm')과 여성('F' or 'f')의 이동거리값의 평균값을 구하여라